Revit 2026 API

# ElementIdParameterValueValue Property

---

The stored value

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId Value { get; set; }
```
```vb
Public Property Value As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ Value {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member Value : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ElementIdParameterValue Class

Autodesk.Revit.DB Namespace